Repository: ioana-manghiuc/vehicle-counting
Catalog: frontend/assets/localization/app_*.arb
Languages: ro

source: Upload video
ro: Încarcă video

source: Draw directions
ro: Desenează direcții

source: Pick Video
ro: Selectează Video

source: Add Direction
ro: Adaugă Direcție

source: From
ro: De la

source: To
ro: Către

source: Save
ro: Salvează

source: Delete
ro: Șterge

# sendToBackend
source: Start counting!
ro: Începe numărarea!

source: Locked
ro: Blocat

source: Editable
ro: Editabil

source: Settings
ro: Setări

source: Theme
ro: Temă

source: Language
ro: Limbă

# directionLabel
source: Direction
ro: Direcție

# direction_ns
source: North - South
ro: Nord - Sud

# direction_sn
source: South - North
ro: Sud - Nord

# direction_ew
source: East - West
ro: Est - Vest

# direction_we
source: West - East
ro: Vest - Est

source: Pick a color
ro: Alege o culoare

source: Cancel
ro: Anulează

source: Direction Error
ro: Eroare de Direcție

# pleaseDrawDirection
source: Please draw a direction on the canvas first.
ro: Te rog desenează o direcție pe pânză mai întâi.

source: Error
ro: Eroare

source: No direction selected.
ro: Nicio direcție selectată.

source: Waiting for server...
ro: Așteptăm răspunsul serverului...

source: User manual
ro: Manual utilizator

# userManualIntro
source: Follow these steps to get started:
ro: Urmează acești pași ca să începi:

# userManualStepUpload
source: Click the canvas or upload button to select a video.
ro: Apasă pe canvas sau pe butonul de încărcare pentru a selecta un video.

# userManualStepWait
source: Wait while the server prepares the thumbnail.
ro: Așteaptă ca serverul să pregătească miniatura.

# userManualStepDraw
source: Click to add points on the image to create direction lines, add labels, and lock them.
ro: Apasă pentru a adăuga puncte pe imagine și a crea linii de direcție, adaugă etichete și blochează-le.

# userManualStepSend
source: Send the locked directions to the backend.
ro: Trimite direcțiile blocate către backend.

# userManualTip
source: Tip: You can change colors before drawing a new direction.
ro: Sfat: Poți schimba culorile înainte să desenezi o direcție nouă.

# tapCanvasToUpload
source: Tap the canvas or button to upload a video
ro: Atinge canvasul sau butonul pentru a încărca un videoclip

# modelInfoTooltip
source: Click for more information about models
ro: Faceți clic pentru mai multe informații despre modele

# howToChooseModel
source: How to Choose the Right Model for Your Hardware
ro: Cum să alegi versiunea YOLO11 potrivită?

# multipleLinesDirection
source: Multiple lines for direction
ro: Linii multiple pentru direcție

# yolo11VersionLabel
source: YOLO 11 version
ro: Versiune YOLO 11

# startScreenWelcome
source: Welcome to VCount!
ro: Bine ai venit la VCount!

# resultsTitle
source: Results
ro: Rezultate

source: Back
ro: Înapoi

# uploadVideoToStartDrawingDirections
source: Upload a video to start drawing directions
ro: Încarcă un video pentru a începe să desenezi direcții

# directionWarning
source: Direction must have at least 2 points
ro: Direcția trebuie să aibă cel puțin 2 puncte

source: Intersection Name
ro: Numele Intersecției

# intersectionNameHint
source: e.g. Baker St â€“ Paddington St
ro: ex. Str. Iuliu Maniu – Str. Vlad Țepeș

source: No saved intersections found.
ro: Nu s-au găsit intersecții salvate.

source: Close
ro: Închide

source: Save Intersection
ro: Salvează Intersecție

source: Load Intersection
ro: Încarcă Intersecție

# appDescription
source: Direction-aware vehicle counting with quick drawing and YOLO-ready pipelines.
ro: Numărare de vehicule cu conștientizare direcțională, desen rapid și pipeline-uri pregătite pentru YOLO.

# intersectionSaved
source: Intersection "{name}" saved in intersections folder!
ro: Intersecția "{name}" a fost salvată în dosarul de intersecții!

# invalidFileContent
source: Invalid file content. Please select a valid intersection JSON file.
ro: Conținut de fișier invalid. Te rog selectează un fișier JSON valid pentru intersecție.

# twoLinesRequired
source: Direction is defined by two lines! Edit current lines or start a new direction
ro: Direcția este definită de două linii! Editează liniile curente sau începe o nouă direcție

# loadFromDisk
source: Add file
ro: Selectează fișier

# intersectionLoaded
source: Intersection "{name}" loaded!
ro: Intersecția "{name}" a fost încărcată!

# intersectionDeleted
source: Intersection "{name}" deleted!
ro: Intersecția "{name}" a fost ștearsă!

# labelsAndLineRequired
source: From / To labels required and draw at least one line.
ro: Etichetele De la / Către sunt necesare și desenează cel puțin o linie.

source: Line
ro: Linie

source: Lines
ro: Linii

# entryLineLabel
source: ENTRY
ro: Prima linie (intrare)

# exitLineLabel
source: EXIT
ro: A doua linie (ieșire)

# lineWithNumber
source: Line {number}
ro: Linia {number}

source: Download Results
ro: Descarcă Rezultate

source: Download JSON
ro: Descarcă JSON

source: Download CSV
ro: Descarcă CSV

# resultsDownloaded
source: Results downloaded successfully
ro: Rezultatele au fost descărcate cu succes

source: Processing video...
ro: Se procesează videoclipul...

source: Enter intersection name
ro: Introdu numele intersecției

source: Confirm
ro: Confirmă

source: Vehicle Counts by Direction
ro: Numărătoare Vehicule pe Direcție

source: Summary
ro: Rezumat

source: Intersection
ro: Intersecție

source: Processing Time
ro: Timp de procesare

source: Total Frames
ro: Total cadre

source: Directions Count
ro: Număr direcții

source: Video Dimensions
ro: Dimensiuni video

source: Direction
ro: Direcție

source: Cars
ro: Mașini

source: Bikes
ro: Biciclete

source: Buses
ro: Autobuze

source: Trucks
ro: Camioane

source: No results available
ro: Nu sunt disponibile rezultate

source: Error Processing Results
ro: Eroare la procesarea rezultatelor

source: Failed to download JSON
ro: Eșec la descărcarea JSON

source: Failed to download CSV
ro: Eșec la descărcarea CSV

# noVideoAvailable
source: No annotated video available
ro: Video anotat indisponibil

source: Loading video...
ro: Se încarcă videoclipul...
